[
  {
    "title": "Smartglass",
    "img": "assets/img/smartglass.png",
    "desc": [
      {
        "text": "Smartglass se trata de mi Trabajo de Fin de Grado (calificado con Matrícula de Honor)."
      },
      {
        "text": "Este consistió en la implementación de un gemelo digital para una máquina-herramienta industrial en colaboración empresa-universidad en el contexto de la Industria 4.0 y el IoT."
      },
      {
        "text": "En él se puso en práctica una metodología propuesta por dos investigadores de la Universidad de Auckland."
      },
      {
        "text": "Para su desarrollo se empleó la arquitectura hexagonal y principios de Domain-Driven Design (DDD)."
      },
      {
        "text": "También, se construyó una ontología OWL DL haciendo uso del IDE Protégé, el framework Apache Jena y el estándar ISO 14649 para representar de manera fidedigna el modelo de datos y de comunicación del gemelo."
      },
      {
        "text": "Además, se utilizó Spring como tecnología back-end y Angular como framework de desarrollo front-end, así como GitHub Actions para la implementación de pipelines de CI/CD."
      },
      {
        "text": "Gracias a este proyecto he podido comprender las necesidades de la I4.0 y cómo aplicar distintas técnicas que permiten extraer información analítica del proceso productivo de una planta industrial."
      }
    ],
    "link": "http://155.210.68.101/"
  },
  {
    "title": "MiBus",
    "img": "assets/img/mibus.png",
    "desc": [
      {
        "text": "Proyecto que surge por la idea personal de mejorar el servicio de trasporte urbano de la ciudad de Teruel."
      },
      {
        "text": "En él apliqué técnicas de Web Scraping para extraer información de sistemas de información desactualizados añadiéndoles significado y valor a través de procesos ETL."
      },
      {
        "text": "Gracias a él pude profundizar en nuevas tecnologías como Typescript, NodeJS, React, etc."
      },
      {
        "text": "Además, conseguí familiarizarme con la puesta en producción de sistemas reales, así como en la importancia de la mantenibilidad."
      }
    ],
    "link": "http://www.mibusteruel.es"
  },
  {
    "title": "OperationsManager",
    "img": "assets/img/operations_manager.png",
    "desc": [
      {
        "text": "Proyecto realizado durante mis prácticas universitarias en PLATA (Plataforma Aeroportuaria de Teruel)."
      },
      {
        "text": "Se trata de una aplicación nativa de escritorio, desarrollada en Java, que permite el procesamiento de las operaciones aeroportuarias que se han desarrollado en el aeropuerto de Teruel (LETL)."
      },
      {
        "text": "Para ello se tuvo que hacer uso de procesos ETL con el objetivo de centralizar la información proveniente de las fuentes de datos disponibles, garantizando su integridad."
      },
      {
        "text": "Gracias a esto se permite la generación de gráficos analíticos que simplifican la toma de decisiones en el proceso de gestión del aeropuerto."
      }
    ],
    "link": "https://github.com/adrianliz/OperationsManager"
  },
  {
    "title": "Futuros proyectos",
    "desc": [
      {
        "text": "Continuar aprendiendo y mejorando día a día."
      },
      {
        "text": "Seguir investigando las metodologías prácticas de implementación de gemelos digitales."
      },
      {
        "text": "Termostato inteligente a través del IoT."
      },
      {
        "text": "¿Quién sabe qué más?"
      }
    ]
  }
]
